---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Sweep
source: html/85251912-0169-bf8b-f461-845e8af269e0.htm
---
# Sweep Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.